app/controllers/articles_controller.rb

UPDATE "articles" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "My edit"], ["description", "My article description"], ["updated_at", "2020-02-25 22:54:02.538991"], ["id", 1]]
---
  def update
    @article = get_article
    @article.update(title: params[:article][:title],
    description: params[:article][:description])